Revit 2026 API

# ContextualHelp Properties

---

The ContextualHelp type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | HelpPath | The context id, help URL, or help file path. |
|  | HelpTopicUrl | The help topic URL. |
|  | HelpType | The contextual help type. |

#### Reference

ContextualHelp Class

Autodesk.Revit.UI Namespace